#+TITLE: Envoy WASM dynamic host rewriting

#+begin_quote
Rewrite the location header with Envoy, written in Golang and compiled as WASM
#+end_quote

** Deploying in Kubernetes
Create container image
#+begin_src dockerfile :tangle Dockerfile
FROM tinygo/tinygo:0.20.0 AS build
WORKDIR /app
COPY go.* *.go /app/
RUN tinygo build -o wasm.wasm -scheduler=none -target=wasi /app/main.go

FROM envoyproxy/envoy-distroless:v1.20.0 AS final
COPY --from=build /app/wasm.wasm /etc/envoy/wasm.wasm
#+end_src

Build the container image
#+begin_src tmate :window build-wasm
docker build -t envoy-with-registry-k8s-io-wasm .
#+end_src

Push the image out to the other nodes
#+begin_src shell
for NODE_IP in $(kubectl get nodes -l node-role.kubernetes.io/control-plane!='' -o=jsonpath='{.items[*].status.addresses[?(@.type=="InternalIP")].address}'); do
    printf "${NODE_IP} :: "
    docker save envoy-with-registry-k8s-io-wasm:latest | ssh "root@${NODE_IP}" docker load
done
#+end_src

Create a namespace
#+begin_src shell
kubectl create namespace k8s-reg-envoy-wasm -o yaml --dry-run=client | \
    kubectl apply -f -
kubectl label namespace k8s-reg-envoy-wasm cert-manager-tls=sync --overwrite
#+end_src

#+RESULTS:
#+begin_example
namespace/k8s-reg-envoy-wasm created
namespace/k8s-reg-envoy-wasm labeled
#+end_example

Create a ConfigMap for the config
#+BEGIN_SRC shell :results silent
kubectl -n k8s-reg-envoy-wasm create configmap config --from-file=envoy\.yaml=./envoy-config.yaml --dry-run=client -o yaml | kubectl apply -f -
#+END_SRC

Configuring Envoy
#+BEGIN_SRC yaml :tangle ./envoy.yaml
apiVersion: apps/v1
kind: Deployment
metadata:
  annotations:
    lastcfg: |
      ${ENVOY_LAST_CFG}
  labels:
    app: k8s-reg-envoy-wasm
  name: k8s-reg-envoy-wasm
spec:
  replicas: 10
  selector:
    matchLabels:
      app: k8s-reg-envoy-wasm
  template:
    metadata:
      annotations:
        lastcfg: |
          ${ENVOY_LAST_CFG}
      labels:
        app: k8s-reg-envoy-wasm
    spec:
      containers:
      - name: envoy
        securityContext:
          runAsUser: 1000
          runAsGroup: 1000
          readOnlyRootFilesystem: true
          allowPrivilegeEscalation: false
        env:
          - name: MATCH_IP
            value: ${MATCH_IP}
        args:
        - -c
        - /etc/envoy/envoy.yaml
        image: envoy-with-registry-k8s-io-wasm:latest
        imagePullPolicy: Never
        volumeMounts:
          - name: config
            mountPath: /etc/envoy/envoy.yaml
            subPath: envoy.yaml
        ports:
          - name: http
            containerPort: 10000
      volumes:
      - name: config
        configMap:
          name: config
---
apiVersion: v1
kind: Service
metadata:
  labels:
    app: k8s-reg-envoy-wasm
  name: k8s-reg-envoy-wasm
spec:
  ports:
  - name: wasm
    port: 10000
    protocol: TCP
    targetPort: 10000
  selector:
    app: k8s-reg-envoy-wasm
  type: ClusterIP
---
apiVersion: networking.k8s.io/v1
kind: Ingress
metadata:
  name: k8s-reg-envoy-wasm
spec:
  rules:
  - host: k8s-reg-envoy-wasm.${SHARINGIO_PAIR_BASE_DNS_NAME}
    http:
      paths:
      - backend:
          service:
            name: k8s-reg-envoy-wasm
            port:
              number: 10000
        path: /
        pathType: ImplementationSpecific
  tls:
  - hosts:
    - k8s-reg-envoy-wasm.${SHARINGIO_PAIR_BASE_DNS_NAME}
    secretName: letsencrypt-prod
#+END_SRC

#+BEGIN_SRC shell :results silent
export \
    ENVOY_LAST_CFG=$(cat Dockerfile main.go envoy-config.yaml wasm.wasm | sha256sum) \
    MATCH_IP="$(kubectl -n "${SHARINGIO_PAIR_NAME}" get pod "${SHARINGIO_PAIR_NAME}-humacs-0" -o=jsonpath='{.status.podIP}')"
envsubst < envoy.yaml | kubectl -n k8s-reg-envoy-wasm apply -f -
#+END_SRC

